import { FC } from 'react'
import { Footer, Header } from '../../feature/homepage/sections'

interface Props {}

const TermsOfUsePage = () => (
  <>
    <Header />
    <div className='container'>
      <ol>
        <li>
          <h1>Основни термини</h1>
          <ol>
            <li>
              <strong>shopsy/shopsy.bg</strong> Представлява се от Ордърклауд ООД, ЕИК: 205243929
            </li>
            <li>
              <strong>Платформата</strong> - софтуерното решение, предоставяно от Shopsy
            </li>
            <li>
              <strong>Продавач</strong> - физическо или юридическо лице, което създава свой сосбтвен
              магазин в платформата
            </li>
            <li>
              <strong>Потребител</strong> - краен потребител на платформата. Човек, който е достъпил
              до магазина на <strong>Продавача</strong> в <strong>Платформата</strong>
            </li>

            <li>
              <strong>Каталог</strong> - Компонент от съвкупоността на предложения(продукти, услуги
              и т.н.), които ПРОДАВЪТ предоставя
            </li>
          </ol>
        </li>
        <li>
          <h1>ПРИЛОЖИМОСТ</h1>
          Настоящите Общи условия са приложими само за Платформата. Shopsy не носи отговорност за
          КАТАЛОГА. Чрез подаването на поръчка или заявка, клиентът сключва директно споразумение с
          ПРОДАВАЧА за поръчване на избраните от ПОТРЕБИТЕЛЯ предложения.
        </li>
        <li>
          <h1>ПРИЛОЖИМО ПРАВО</h1>
          Недействителност или неприложимост, на която и да е разпоредба от тези Общи условия няма
          да засяга действителността или приложимостта на останалите разпоредби. Към съдържанието на
          настоящите Общи условия се прилага действащото законодателство на Република България. При
          всяка поръчка или заявка от Shopsy, било то по през платформата или чрез мобилно
          приложение, Клиентът потвърждава, че е запознат/а и се съгласява с настоящите Общи
          условия.
        </li>

        <li>
          <h1>Забранени предложения(продукти, услуги и т.н.)</h1>
          Това е списък с ПРИМЕРНИ забранени предложения, които е непозволено да се разпространяват
          чрез нашата платформа. Списъкът не е пълен и Shopsy си запазва правото да премахва
          продукти, които не са опоменати в списъка.
          <br />
          <b>Ако забележите такъв продукт, моля сигнализирайте ни на shopsybg@gmail.com.</b>
          <ol>
            <li>Всякакъв вид порнография на какъв да е носител.</li>
            <li>Алкохол</li>
            <li>Животни и всякакви тяхни части</li>
            <li>Наркотици</li>
            <li>Определени от екипа на Shopsy за неетични продукти или услуги.</li>
            <li>
              Всичко, което в момента е забранено от законодателството на страната, в която
              превивавате.
            </li>
          </ol>
          Shopsy ще премахва намерените в някои от тези категории продукти и не може реалистично да
          упражни моментален контрол върху публикуваното съдържание в платформата. Пратени
          оплаквания на имейла ни ще бъдат разглеждани до 72 часа и допълнително се извършва
          ежедневен скрининг на качените в платформата предложения.
        </li>
        <li>
          <h1>КАКВИ ЛИЧНИ ДАННИ ОБРАБОТВАМЕ И ЗАЩО</h1>
          Shopsy обработва вашите лични данни, защото използвате нашите услуги. Използваме следните
          лични данни за следните цели: Осъществяване на поръчка. Ние обработваме личните данни,
          които ни предоставяте, когато правите поръчка. Тези лични данни са необходими, за да бъде
          изпълнена, потвърдена и оценена поръчката. Правното основание за това обработване на лични
          данни е, че то е необходимо за изпълнението на договор, както е определено в GDPR. В
          процеса на поръчка обработваме следните лични данни: име(от Фейсбук профил) снимка(от
          Фейсбук профил) поръчка на коя маса се намирате в момента. коментари Осъществяване на
          заявка. В процеса на заявка обработваме следните лични данни: име(от Фейсбук профил)
          снимка(от Фейсбук профил) Тип заявка на коя маса се намирате в момента. коментари
        </li>
        <li>
          <h1>КАКВИ ТРЕТИ СТРАНИ ПОЛЗВАМЕ ЗА ОБРАБОТКА НА ДАННИ</h1>
          Използваме платформи само на утвърдени софтуерни компании - включващи, но не ограничаващи
          се до Google Analatics, Facebook АНАЛИЗ Също така използваме вашите лични данни, за да
          можем да изпълним задълженията си за отчитане към рекламодателите и за да можем да
          подобрим нашата платформа и гама от продукти и услуги. Правното основание за тази
          обработка е, че е необходимо да се преследва законният интерес на Shopsy (анализ и
          отчитане), както е определено в GDPR. Отчетите не съдържат данни, които биха могли да ви
          идентифицират поименно.
        </li>

        <li>
          <h1>ВЪЗРАСТ НА ПОТРЕБИТЕЛИ</h1>
          Нашата платформа не е предназначена за лица на възраст под 16 години и нямаме намерение да
          събираме лични данни на посетители на уебсайта, които са под 16-годишна възраст. В
          несъстоятелност сме обаче да проверим действителната възраст на посетителите. Ето защо
          съветваме родителите да наблюдават онлайн действията на децата си, за да предотвратят
          предоставянето на личните им данни без съгласието на родителите. Ако считате, че сме
          събрали лични данни на непълнолетен без съгласие, моля, свържете се с нас на адрес
          shopsybg@gmail.com. В резултат ще предприемем изтриване на тези данни.
        </li>
        <li>
          <h1>ДОСТЪП ДО ЛИЧНИ ДАННИ, КОРИГИРАНЕ И ИЗТРИВАНЕ</h1>
          Имате право на достъп до всички лични данни, които събираме за вас, както и правото да
          поискате да ги коригираме или изтрием. Ако смятате, че обработваме вашите лични данни без
          валидно правно основание, или че обработваме лични данни, които не са от значение за
          процеса ни на работа, моля свържете се с нас. Можете да се свържете с shopsybg@gmail.com.
          Shopsy ще отговори на вашето искане възможно най-скоро и във всеки случай не по-късно от
          четири седмици след получаване на вашата заявка.
        </li>
        <li>
          <h1>ПРЕПОРЪКИ, ВЪПРОСИ И ОПЛАКВАНИЯ</h1>В случай, че имате други въпроси или оплаквания
          относно обработката на вашите лични данни, ние ще се радваме да разговаряме. Ние също
          бихме искали да чуем от вас съвети или предложения как да подобрим нашата политика за
          поверителност. СИГУРНОСТ Shopsy се отнася много сериозно към защитата на личните данни и в
          тази връзка предприемаме подходящи мерки за защита на вашите лични данни срещу
          злоупотреба, загуба, неоторизиран достъп, нежелано разкриване и неупълномощени промени.
          Ако смятате, че вашите лични данни не са адекватно защитени или има индикации за
          неправилна употреба, моля свържете се с нас на адрес: shopsybg@gmail.com
        </li>
        <li>
          <h1>ДАННИ ЗА КОНТАКТ</h1>
          Офис +359 88 59 29 379 shopsybg@gmail.com
          <h1>ДЛЪЖНОСТНО ЛИЦЕ ПО ЗАЩИТА НА ЛИЧНИТЕ ДАННИ</h1>
          Кирил Йорданов, съсобственик и управител на Shopsy +359 87 906 4002
          kirilkalinovjordanov@gmail.com
        </li>
      </ol>
    </div>
    <Footer />
  </>
)

export default TermsOfUsePage
